mf2/20240408/mf2_p_7_20240408.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-08 pon 16:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mf2_p7_20240408</title>
<meta name="author" content="Kristofer Robin" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">mf2<sub>p7</sub><sub>20240408</sub></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org52a4ecf">1. Specifična vezavna energija</a>
<ul>
<li><a href="#org9294f34">1.1. Spin in magnetni dipolni moment jedra</a>
<ul>
<li><a href="#orgd621f29">1.1.1. Magnetni moment elektrona</a></li>
<li><a href="#org369ba01">1.1.2. Magnetni dipolni moment protona je:</a></li>
<li><a href="#orgb63a153">1.1.3. Magnetni moment nevtrona je:</a></li>
<li><a href="#orgc76dc87">1.1.4. Magnetni moment jedra</a></li>
</ul>
</li>
<li><a href="#org04d5ef7">1.2. Zgradba jeder</a>
<ul>
<li><a href="#org6a06d17">1.2.1. Transcending kapljični model</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Lastna energija jedra
</p>

\begin{equation}
\label{eq:48}
m(A, Z)c ^2 = Z m_p c ^2 + N m_n c ^2 + W_V(A,Z)
\end{equation}

<p>
kjer je \( W_V(A,Z) \) vezavna energija jedra. Enačbo lahko obrnemo in izrazimo vezavno energijo
</p>

\begin{equation}
\label{eq:49}
W_V(A,Z) = (m(A, Z)  - Z m_p - N m_n) c ^2 = c ^2 ((m(A,Z) + Zm_e) - Z(m_p + m_e) - Nm_n)  = m(^A_Z X) c ^2 - Z m(H) c ^2 - Nm_n c ^2
\end{equation}

<p>
kjer sta \( X \) in \( m(H) \) atomski masi (vezani na vodik)
</p>
<div id="outline-container-org52a4ecf" class="outline-2">
<h2 id="org52a4ecf"><span class="section-number-2">1.</span> Specifična vezavna energija</h2>
<div class="outline-text-2" id="text-1">
<p>
je enaka vezavni energiji na nukleon in jo označujemo z \( w_v \), definirana pa je kot
</p>

\begin{equation}
\label{eq:50}
w_v = \frac{W_V}{A}
\end{equation}

<p>
Numerično se da pokazati, da je \( w_V \approx [-7,4M; -8.7]MeV \) za težja jedra. \( w_V \) je neodvisna od velikosti jedra in to nam pove, da jedrska sila pada zelo hitro z razdaljo.
</p>

<p>
Semiempirična masna formula (Weis&#x2026;)
</p>

\begin{equation}
\label{eq:51}
W_V(A, Z) = - w_0 A + w_1 A^{\frac{2}{3}} + w_2 \frac{Z ^2}{A ^{\frac{1}{3}}} + w_3 \frac{(A - 2Z) ^2}{A} + w_4 \frac{\delta_{ZN}}{A ^{\frac{3}{4}}}
\end{equation}

<p>
Členi so razporejeni po pomembnosti.
</p>

<p>
Ni striktno res, da je \( w_v \) konstantna. Prvi člen izhaja iz skoraj konstantnosti \( w_V \), drugi člen pa je popravek zaradi končne površine (robni nukleoni imajo nukleone samo na eni strani).
</p>

<p>
Gostota nukleonov \( \rho \) (masna/številska) je
</p>

\begin{equation}
\label{eq:52}
\rho \approx = \frac{m_n A}{R_j ^3} \frac{3}{4 \pi} \approx = const
\end{equation}

<p>
Iz tega lahko ugotovimo, da
</p>

\begin{equation}
\label{eq:53}
R_j = A ^{\frac{1}{3}}
\end{equation}

<p>
kar pomeni, da je površina jedra
</p>

\begin{equation}
\label{eq:54}
S_j = A^{\frac{2}{3}}
\end{equation}

<p>
In robni nukleoni so manj vezani napram ostalim nukleonov.
</p>

<p>
Tretji člen je posledica Coulombski odboj protonov. Pogledamo povprečje Coulumbskega odboja preko celotnega jedra in potem dobimo odvisnost
</p>

\begin{equation}
\label{eq:55}
V_c \propto \frac{Z ^2e ^2}{R_j}
\end{equation}

<p>
Večji \( R_j \) bo pomenilo večja razdalja, ampak hkrati tudi več protonov. \( Z ^2 \) je na kvadrat, ker je brez samo za en proton, imamo pa \( Z \) protonov. Tretji člen se da zelo dobro numerično izračunati.
</p>

<p>
Četrti člen izhaja iz opažanj, da so najbolj vezana jedra pri \( N \approxeq Z \). Proporcionalno je s sodo potenco in ni potrebe po kvadratu (lahko je tudi na 4). Potem normiramo z imenovalcem in ker je vrednost ulomka samo za en nukleon, moramo pomnožiti še z \( A \), da dobimo vrednost za vse nukleonov. Ta popravek je posledica Paulijevega izključitvenega principa in končne zasedenosti št. stanj (protoni in nevtroni so tudi na nekih energijskih stanjih (ki pa jih ne poznamo)).
</p>

\begin{equation}
\label{eq:56}
 \frac{(1 - \frac{Z}{N})^2}{(1 + \frac{Z}{N}) ^2} A \propto \frac{(A - 2Z)^2}{A}
\end{equation}

<p>
Delci v energijskih nivojih imajo tudi spin. Ceneje je dodati proton v nivo, kjer je samo en proton s spinom gor, kakor pa nevtron v nov energijski nivo. Tako ločimo med sodo-sodo, sodo-liho in liho-liho številom nukleonov v jedru
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">nivo</td>
<td class="org-left">p</td>
<td class="org-left">n</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">up &amp; 0</td>
<td class="org-left">0 &amp; 0</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">up &amp; down</td>
<td class="org-left">up &amp; down</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">up &amp; down</td>
<td class="org-left">up &amp; down</td>
</tr>
</tbody>
</table>

<p>
Tako pridemo do 4. popravnega člena, ki se mu reče tudi <i>paritveni člen</i>, kjer velja
</p>

\begin{equation}
\label{eq:57}
\delta_{ZN} = \begin{cases}
-1 & \text{za Z sodo- N sodo jedra} \\
0 & \text{za Z sodo/liho - N liho/sodo jedra}\\
1 & \text{za Z liho- N liho jedra}
\end{cases}
\end{equation}

<p>
Približki teh členov so v vrstnem redu \( 15.6 MeV, 17.3 MeV, 0.7MeV, 23.3 MeV, 33.5 MeV \).
</p>

<p>
Masa atoma je
</p>

\begin{equation}
\label{eq:58}
M(^A_ZX) = Z m_H + Nm_N + W_V (A,Z) \frac{1}{c ^2}
\end{equation}

<p>
Takemu modelu brez 4. člena se reče tudi <i>kapljični model jedra</i>, iz katerega potem izpeljemo še <i>lupinasti model</i>.
</p>
</div>
<div id="outline-container-org9294f34" class="outline-3">
<h3 id="org9294f34"><span class="section-number-3">1.1.</span> Spin in magnetni dipolni moment jedra</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Proton in nevtron imata spin \( \frac{1}{2} \). Spinu jedra prispevajo spini nukleonov in tirne vrtilne količine nukleonov.
</p>

<p>
Iz zgoraj naštetih dejstev že vemo nekaj dejstev:
</p>

<ul class="org-ul">
<li>če imamo sodo-sodo št. jeder je spin približno 0 (imamo poparjene spine in nasprotne tirne vrtilne količine).</li>
<li>uganemo tudi za sodo-liha jedra: prispevek spina ima \( \pm \frac{1}{2} \) in pa še tirna vrtilna količina nesparjenega nukleona), kar pomeni da je spin pol-celoštevilčen</li>
<li>liha jedra: zagotovo lahko rečemo, da je spin celoštevilčen (ostane na neki kvalitativni ravni razumevanja).</li>
</ul>
</div>
<div id="outline-container-orgd621f29" class="outline-4">
<h4 id="orgd621f29"><span class="section-number-4">1.1.1.</span> Magnetni moment elektrona</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
\( s = \frac{1}{2} \) v stanju \( n = \frac{1}{2} \) v smeri mag. polja. \( Q_e = -e_0 \text{ in } m = m_e \).
</p>

\begin{equation}
\label{eq:59}
\mu_e = - \mu_B = - \frac{1}{2} \frac{e_0 \hbar}{m_e} g_e
\end{equation}

<p>
kjer je \( \mu_B \) Bohrov magneton. V primerjavi s klasičnim je premajhen \( \mu = \frac{QL}{2m}g \) in zato dodamo \( g_e \) giroskopkso en. Po Diracovi enačbi določimo \( g_e = 2 \).
</p>
</div>
</div>
<div id="outline-container-org369ba01" class="outline-4">
<h4 id="org369ba01"><span class="section-number-4">1.1.2.</span> Magnetni dipolni moment protona je:</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Spin je še zmeraj \( s = \frac{1}{2} \), \( Q_p = e_0 \) in \( m = m_p \). To potem pomeni, da je jedrski magneton
</p>

\begin{equation}
\label{eq:60}
\mu_j = \frac{e_0 \hbar}{2 m_p} = \frac{m_e}{m_p} \mu_B = 5 \times 10^{-27} Am ^2
\end{equation}

<p>
Protonov magneton je
</p>

\begin{equation}
\label{eq:61}
\mu_p = 2.79 \mu_j \implies g_p \approxeq 5.6
\end{equation}

<p>
iz česar sledi, da ima proton podstrukturo.
</p>
</div>
</div>
<div id="outline-container-orgb63a153" class="outline-4">
<h4 id="orgb63a153"><span class="section-number-4">1.1.3.</span> Magnetni moment nevtrona je:</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Naboj \( Q_n = 0 \) in če bi bil točkast bi pričakovali \( \mu_n = 0 \), vendar je v praksi \( \mu_n = -1.91 \mu_j \implies g_n = -3.8 \)
</p>
</div>
</div>
<div id="outline-container-orgc76dc87" class="outline-4">
<h4 id="orgc76dc87"><span class="section-number-4">1.1.4.</span> Magnetni moment jedra</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
K temu prispevajo obhodni in spinski magentni momenti (vsi spinski momenti vseh nukleonov ter obhodni momenti elektronov).
</p>

<p>
Ponovitev nomenklature iz MF1:
</p>

<p>
Podobno kot pri atomu je efektivni magnetni moment s komponento v smeri magnetnega polja \( \vec{B} \parallel \vec{e}_{+} \)
</p>

\begin{equation}
\label{eq:62}
(\mu_z)_{M_J} = g \mu_j M_J
\end{equation}

<p>
To je projekcija na z-os.
</p>

<p>
\( g \) je efektivno giromagnetno razmerje jedra, medtem ko nam \( M_J \) meri komponente v smeri z. Možne vrednosti so \( -J, -J + 1, \ldots, J \). Tako imamo \( 2J +1 \) stanj.
</p>

<p>
Klasično jedra začnejo precesirati, kvantno preskakujejo med stanji j.
</p>

<p>
Definiramo energijo magnetnega dipola v zunanjem magnetnem polju je
</p>

\begin{equation}
\label{eq:63}
W_{n_j} = - (\mu_z)_{M_J} B = - g M_J \mu_j B
\end{equation}

<p>
Veliki \( J \) označuje celotno moment jedra (in je različen od \( j \)).
</p>

<p>
Pri prehodu med sosednjima stanjema se izseva/absorbira foton in frekvenca \( \nu \):
</p>

\begin{equation}
\label{eq:64}
h \nu = \Delta W_{M_J} = W_{M_J} - W_{M_J \pm 1} = \pm g \mu_j B
\end{equation}

<p>
Eksperimentalno lahko variiramo bodisi \( B \) ali pa \( \nu \), s katero vzbujamo ta jedra.
</p>

<p>
Enačba \ref{eq:64}  se imenuje resonančni pogoj in raziskavi, kjer iščemo to se imenuje <i>magnetna jedrska resonanca</i>. Uporablja se v raziskavi snovi (ker so za jedra že znani podatki) in tako spada bolj v domeno trde snovi kakor pa jedrske zizike.
</p>

<p>
Konvencija za definicije magnetnih momentov je, da vzamemo magnetni moment jedra v maksimalni projekciji \( M_J = J \).
</p>

\begin{equation}
\label{eq:65}
(\mu_z)_{M_J = J} = g J \mu_j = \frac{h\nu}{B} J
\end{equation}
</div>
<ol class="org-ol">
<li><a id="orgf716f97"></a>Delovanje jedrske magnetne resonance<br />
<div class="outline-text-5" id="text-1-1-4-1">
<p>
S7.1
</p>

<p>
Snov postavimo v magnetno polje, ko se spini uredijo v smeri, pošljemo prečno EM valovanje s frekvenco \( \nu \). Tako dobimo resonanco na grafu S7.2
</p>

<p>
Drugi način je pulzni način (ang. <i>nuclear magnetic resonance or (NMR)</i>) in se ekstenzivno uporablja pri preiskavah materialov. Opazuje se kemijski premik ali razcep absorpcijskih vrhov.
</p>

<p>
Pulzno dovajamo frekvenco in po prenehanju bo snov z enako frekvenco sevalo nazaj. Kemijski premik je to, da se resonančni vrh premakne (bodisi v levo ali desno), pri razcepu pa dobimo več le-teh. To se zgodi zaradi variacije magnetnega polja znotraj kristala in molekul.
</p>

<p>
Primer:
</p>

<ul class="org-ul">
<li><p>
proton (== vodik)
</p>

<p>
Pri \( B = 1T \) dobimo magnetno resonanco pri frekvenci \( \nu = 42.6 MHz \) (radiofrekvenčni spekter).
</p>

\begin{equation}
\label{eq:66}
\nu = \frac{g \mu_j}{h}B
\end{equation}

<p>
Vrednosti \( g \) in \( \mu_j \) so bile prej podane.
</p></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org04d5ef7" class="outline-3">
<h3 id="org04d5ef7"><span class="section-number-3">1.2.</span> Zgradba jeder</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6a06d17" class="outline-4">
<h4 id="org6a06d17"><span class="section-number-4">1.2.1.</span> Transcending kapljični model</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Vstavi skico \( |w_v(A)| \), ki jo bo prof. dal na spletno učilnico. Gladka krivulja z vrhovi, ki izstopajo tekom nje (pri določenih vrednosti A (oz. Z in N)), kar pomeni, da so bolj vezana kot ponavadi. Vrednosti so pri \( Z, N = 28 \), \( Z, N = 50 \), \( Z, N = 82 \), itd. Temu pravimo <i>magična števila</i>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kristofer Robin</p>
<p class="date">Created: 2024-04-08 pon 16:31</p>
</div>
</body>
</html>
